# -*- coding: utf8 -*-
pac_vac1 = ['Полипенко Злата Сергевна', 'Уликов Наркис Арсенович', 'Ганусяк Стратбник Мирхатимович', 'Дмытрук Адам Тарикулиевич', 'Желтикова Ливия Хабасовна', 'Венецианова Болеслава Мартиновна', 'Кульшенко Голиндуха Будаевна', 'Глухенько Агарь Игорьевна', 'Крюченков Ермила Мугаллимович', 'Глушанин Эразм Бичикоевич', 'Полицеймаков Ардальон Мэлсович', 'Агеечива Далила Рафкатовна', 'Файзетдинова Ноэми Марселовна', 'Позолотчиков Никифор Сабриевич', 'Ляндрова Олдама Демидовна', 'Микеров Изяслав Умат-Гиреевич', 'Анрюкова Селестина Сайфулловна', 'Талько Дина Крикоровна', 'Матеченков Любим Ильгамович', 'Трошинкин Даниил Витаутович', 'Нашикина Сабина Искандяровна', 'Блесткина Рогнеда Мурадиновна', 'Клетинский Ларион Шарофович', 'Игорянова Цветана Онуфриевна', 'Станакина Анна Фроловна', 'Ажикмал Трофим Юсифович', 'Рункова Велислава Шаликовна', 'Хруев Евфимий Дионисович', 'Котина Феонилла Талятовна', 'Модичева Мина Ризвановна', 'Литвак Доминик Рахматуллоевич', 'Лавиненко Алина Зубаировна', 'Солеваров Вильгельм Зауриевич', 'Лаврунова Флора Вилорьевна', 'Биджиева Елена Габдрашитовна', 'Батулова Тома Гумаровна', 'Кочанский Анисим Несторович', 'Мошетов Вассиан Ширванович', 'Вылку Гремислав Алаудинович', 'Демиткина Матрона Харисовна', 'Крыштак Анастасий Айсович', 'Шайко Эмиль Аристархович', 'Петрушинская Конкордия Далгатовна', 'Ахламова Матильда Нуруллаевна', 'Куфтин Амвросий Даудович', 'Кабликов Самсоний Айзикович', 'Голото Велимира Шмавоновна', 'Ланковиц Елисей Минаевич', 'Томачева Элеонора Герасимовна', 'Чаргян Исаакин Каурбекович', 'Пакузо Ириней Габдулхатович', 'Барошина Ангела Климовна', 'Лядов Асафий Иоганович', 'Чичинева Ядвига Эльдаровна', 'Моторнов Гермоген Финатович', 'Диковицкий Моисей Осипович', 'Шелупцова Аида Ахатовна', 'Новородская Алла Низамиевна', 'Коровушкина Секлетинья Рашитовна', 'Лободина Маргарита Рабадановна', 'Башманова Неонила Мухарбековна', 'Кланица Евсевия Рейнгольдовна', 'Окигина Глафира Ашуровна', 'Мусаренков Тит Абраамович', 'Хорошенков Каллимах Юpьевич', 'Микулик Флавиан Курманович', 'Зулин Венедикт Асанович']
pac_vac2 = ['Каргапольцева Полина Николаевна', 'Колягин Эдуард Анатольевич','Микулик Флавиан Курманович',  'Кочанский Анисим Несторович',  'Куфтин Амвросий Даудович',  'Венецианова Болеслава Мартиновна',  'Крыштак Анастасий Айсович',  'Рункова Велислава Шаликовна',  'Голото Велимира Шмавоновна',  'Уликов Наркис Арсенович',  'Клетинский Ларион Шарофович',  'Мусаренков Тит Абраамович',  'Лядов Асафий Иоганович',  'Барошина Ангела Климовна',  'Кабликов Самсоний Айзикович',  'Шайко Эмиль Аристархович',  'Петрушинская Конкордия Далгатовна',  'Крюченков Ермила Мугаллимович',  'Солеваров Вильгельм Зауриевич',  'Микеров Изяслав Умат-Гиреевич',  'Диковицкий Моисей Осипович',  'Литвак Доминик Рахматуллоевич',  'Ганусяк Стратбник Мирхатимович',  'Лаврунова Флора Вилорьевна',  'Хорошенков Каллимах Юpьевич',  'Ляндрова Олдама Демидовна',  'Окигина Глафира Ашуровна',  'Пакузо Ириней Габдулхатович',  'Трошинкин Даниил Витаутович',  'Биджиева Елена Габдрашитовна',  'Полицеймаков Ардальон Мэлсович',  'Полипенко Злата Сергевна',  'Зулин Венедикт Асанович',  'Анрюкова Селестина Сайфулловна',  'Кульшенко Голиндуха Будаевна',  'Глухенько Агарь Игорьевна',  'Моторнов Гермоген Финатович',  'Нашикина Сабина Искандяровна',  'Агеечива Далила Рафкатовна',  'Станакина Анна Фроловна',  'Ахламова Матильда Нуруллаевна',  'Матеченков Любим Ильгамович',  'Хруев Евфимий Дионисович',  'Лавиненко Алина Зубаировна',  'Коровушкина Секлетинья Рашитовна',  'Батулова Тома Гумаровна',  'Модичева Мина Ризвановна',  'Томачева Элеонора Герасимовна']

# 1. Добавить пациента в список первого этапа вакцинации
#Здесь нужен код
pac_vac1.append(input())

# 2. Найти количество пациентов, которые прошли все два этапа вакцинации и вывести их фамилии
#Здесь нужен код
new_list = []
count = 0
for i in pac_vac1:
    if i in pac_vac2:
        count += 1
        new_list.append(i)
new_list.sort()
count_ignore2 = count #Вместо None найти количество нужных пациентов
pac_list2 =  new_list #Вместо None составить отсортированный список с фио нужных пациентов
print(f'Количество пациентов, которые прошли оба этапа вакцинации - {count_ignore2}.\nИх фамилии: {", ".join(pac_list2)}\n')

# 3. Найти количество пациентов, которых нужно обзвонить, чтобы они пришли на второй этап вакцинации  и вывести их фамилии
#Здесь нужен код
new_list = []
count = 0
for i in pac_vac1:
    if i not in pac_vac2:
        count += 1
        new_list.append(i)
new_list.sort()

count_ignore3 = count #Вместо None найти количество нужных пациентов
pac_list3 =  new_list #Вместо None составить отсортированный список с фио нужных пациентов
print(f'Количество пациентов, которых нужно обзвонить, чтобы пришли на 2й этап вакцинации - {count_ignore3}.\nИх фамилии: {", ".join(pac_list3)}\n')